app/views/posts/index.html.erb

SELECT `licenses`.* FROM `licenses`
---

              <%= select_tag :search, options_from_collection_for_select(License.all,:license_name, :license_name), {include_blank: true} %>