app/controllers/employees_controller.rb

SELECT `employees`.* FROM `employees`
---
  def index
    @employee = Employee.all

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 3 LIMIT 1
---
  def show
    @employee = Employee.find_by(id: params[:id])