app/controllers/licenses_controller.rb

INSERT INTO `licenses` (`license_name`, `expiration`, `surveillance`, `S_recommendation`, `created_at`, `updated_at`) VALUES ('test10', '無期限', '有', NULL, '2019-08-28 00:14:25', '2019-08-28 00:14:25')
---
  def create
    @license = License.new(
      license_name: params[:license_name],
      expiration: params[:expiration],
      surveillance: params[:surveillance],
      S_recommendation: params[:S_recommendation],
      J_recommendation: params[:J_recommendation],
      allowance: params[:allowance],
      bonus: params[:bonus]
      )

      if @license.save

SELECT `licenses`.* FROM `licenses`
---
  def index
    @license = License.all

SELECT  `licenses`.* FROM `licenses` WHERE `licenses`.`id` = 20 LIMIT 1
---
  def show
    @license = License.find_by(id: params[:id])

SELECT  `licenses`.* FROM `licenses` WHERE `licenses`.`id` = 20 LIMIT 1
DELETE FROM `licenses` WHERE `licenses`.`id` = 17
---
  def destroy
    @license = License.find_by(id: params[:id])
    @license.destroy

SELECT  `licenses`.* FROM `licenses` WHERE `licenses`.`id` = 13 LIMIT 1
---
  def edit
    @license = License.find_by(id: params[:id])

SELECT  `licenses`.* FROM `licenses` WHERE `licenses`.`id` = 13 LIMIT 1
UPDATE `licenses` SET `expiration` = '5年', `surveillance` = '無', `S_recommendation` = 0, `last_editor` = 'test2', `updated_at` = '2019-08-28 00:14:45' WHERE `licenses`.`id` = 19
---
  def update
    @license = License.find_by(id: params[:id])
    @license.license_name = params[:license_name]
    @license.expiration = params[:expiration]
    @license.surveillance = params[:surveillance]
    @license.S_recommendation = params[:S_recommendation]
    @license.J_recommendation = params[:J_recommendation]
    @license.last_editor = @current_user.user_name

    if @license.save