app/controllers/posts_controller.rb

  def index
    @post = Post.search(params[:search])
---
SELECT `posts`.* FROM `posts` WHERE (license_name LIKE '%%') AND (holder_name LIKE '%%')

  def show
    @post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 0 LIMIT 1

  def create
    @post = Post.new(license_name: params[:license_name],
       holder_name: params[:holder_name],
       date_of_license: params[:date_of_license])

    if @post.save
---
INSERT INTO `posts` (`license_name`, `holder_name`, `date_of_license`, `created_at`, `updated_at`) VALUES ('A-2H', '後藤　勝彦', '2020-01-01', '2019-08-18 07:48:53', '2019-08-18 07:48:53')

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 5 LIMIT 1

  def update
    @post = Post.find_by(id: params[:id])
    @post.date_of_license = params[:date_of_license]
    @post.last_editor = @current_user.user_name

    if @post.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `date_of_license` = '2030-01-01', `Last_editor` = '#<User:0x000000000c5d40b0>', `updated_at` = '2019-08-18 13:31:00' WHERE `posts`.`id` = 5

  def destroy
    flash[:notice] = "1件削除しました"
    @post = Post.find_by(id: params[:id])
    @post.destroy
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 10 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 10