app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`user_id` = '1000' AND `users`.`password` = 'doraemon' LIMIT 1
---
	def login
		 @user = User.find_by(user_id: params[:user_id], password: params[:password])

INSERT INTO `users` (`user_id`, `user_name`, `password`, `created_at`, `updated_at`) VALUES ('3000', 'krsw', 'testtest', '2019-08-20 14:19:27', '2019-08-20 14:19:27')
---
	def create
		@user = User.new(user_id: params[:user_id], user_name: params[:user_name], password: params[:password])

		if @user.save